Revit 2026 API

# Transform2DOfPoint Method

---

Applies the transformation to the point and returns the result.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public UV OfPoint(
	UV point
)
```
```vb
Public Function OfPoint (
	point As UV
) As UV
```
```cpp
public:
UV^ OfPoint(
	UV^ point
)
```
```fsharp
member OfPoint :
        point : UV -> UV
```

#### Parameters

point UV
     The point to transform.

#### Return Value

UV The transformed point.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Transformation of a point is affected by the translational part of the transformation.

#### Reference

Transform2D Class

Autodesk.Revit.DB Namespace